In [1]:
!pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.8/site-packages (1.1.3)
Requirement already satisfied: pytz>=2017.2 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

In [3]:
draft1 = pd.read_csv('/Users/rakeshreddy/Downloads/examples/ex1.csv')

In [4]:
draft1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
type(draft1)

pandas.core.frame.DataFrame

In [6]:
draft1['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [11]:
draft1.tail(2)

   a   b   c   d message
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
draft1.head(2)

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [14]:
df = pd.read_table('/Users/rakeshreddy/Downloads/examples/test.tsv')

In [15]:
df

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [19]:
df = pd.read_csv('/Users/rakeshreddy/Downloads/examples/test.tsv',sep="\t")

In [20]:
df

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [21]:
type(df)

pandas.core.frame.DataFrame

In [24]:
pd.read_csv('/Users/rakeshreddy/Downloads/examples/ex1.csv',header = None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [25]:
pd.read_csv('/Users/rakeshreddy/Downloads/examples/ex1.csv',header = None,names=['A','B','C','D'])

    A   B   C        D
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [32]:
d=pd.read_csv('/Users/rakeshreddy/Downloads/examples/ex5.csv')

In [33]:
pd.isnull(d)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [34]:
pd.isnull(d).countnt()

something    3
a            3
b            3
c            3
d            3
message      3
dtype: int64

In [35]:
pd.isnull(d).sum()

something    0
a            0
b            0
c            1
d            0
message      1
dtype: int64

In [37]:
dr=pd.read_html('/Users/rakeshreddy/Downloads/examples/fdic_failed_bank_list.html')

In [38]:
dr

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]